{
  "results": [
    {
      "title": "Developer",
      "company": {
        "display_name": "NTT DATA Business Solutions"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-13T09:13:42Z",
      "redirect_url": "https://www.adzuna.in/details/5247636602?utm_medium=api&utm_source=6fec1d82",
      "description": "• Utilize your minimum of 10 years of overall SAP experience to design, develop, and maintain SAP applications on the SAP BTP platform. • Demonstrate expertise in UI5 development, creating responsive and user-friendly interfaces. • Utilize BAS (Business Application Studio) to efficiently develop, test, and deploy SAP applications. • Collaborate with the development team and utilize code repository tools like GitHub to manage source code and version control. • Possess strong knowledge of Node.js…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "RAPTAR Reporting"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-05-25T09:03:27Z",
      "redirect_url": "https://www.adzuna.in/details/5215279684?utm_medium=api&utm_source=6fec1d82",
      "description": "Developer We are looking for a motivated Developer/Web Developer to join our growing team! This is an exciting opportunity for someone with a keen interest in software development, eager to work on a healthcare case intake tool used by pharmaceutical companies, healthcare professionals and members of the general public. About PharSafer: PharSafer® is a specialist Pharmacovigilance & Medical Service CRO, headquartered in the UK, with offices in India. Due to continued company growth, we are seek…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-22T09:11:07Z",
      "redirect_url": "https://www.adzuna.in/details/5262511384?utm_medium=api&utm_source=6fec1d82",
      "description": "TCS Is Hiring for ServiceNow Developer Job Description Job Role : ServiceNow Developer Experience : 4 to 10 Years Location : Hyderabad Interview mode: Face-to-face Interview on 28th June at TCS Hyderabad Must Have : Experience in ITSM, ITOM and Servicenow Discovery module with experience in implementation, configuration, updates & troubleshooting. Deep understanding and solutioning capabilities in ServiceNow Global scope and foundational data such as Location, Organization, CMDB Working knowled…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Zensar Technologies"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T09:47:31Z",
      "redirect_url": "https://www.adzuna.in/details/5235655199?utm_medium=api&utm_source=6fec1d82",
      "description": "Key Responsibilities: Develop and maintain web applications using React.js for the frontend and Python Django for the backend. Design and implement RESTful APIs using Django Rest Framework. Good understanding of database concepts, especially in PostgreSQL. Participate in Agile development practices and contribute to team efforts. Work directly with clients with minimal support. Engage in code reviews to improve code quality and development practices. Qualifications: Should have exp in React 16,…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "ITC Infotech"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-06-15T08:47:52Z",
      "redirect_url": "https://www.adzuna.in/details/5251430776?utm_medium=api&utm_source=6fec1d82",
      "description": "Hi All, We've 10 Open Positions for Kinaxis Developer. We have Apriso Developer position at ITC Infotech that could be a perfect match for you. We are currently looking for an experienced Kinaxis Developer to join our team in Baner, Pune. PFB job description for the same. Open Positions- 10 Interview Round - 2 Location - Baner, Pune. Please share your updated resume along with below details @ manashi.adhikari@itcinfotech.com Total Experience- Relevant Experience- Current Location- Current and E…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "ITC Infotech"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-04T09:21:16Z",
      "redirect_url": "https://www.adzuna.in/details/5231821541?utm_medium=api&utm_source=6fec1d82",
      "description": "Roles And Responsibilities: Develop solution proposals for the given requirements Develop application code, Debug, Perform Code Review, Code Optimization, Validation and testing Develop custom solutions based on Windchill APIs, Customization of Windchill Product Incident and Problem analysis and fixing Maintenance of existing Windchill applications Technical Skills: Good knowledge of Windchill 11/12/13 PDMLink, ProjectLink and Partslink modules. Sound knowledge and experience in Windchill Busin…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-06-21T08:53:01Z",
      "redirect_url": "https://www.adzuna.in/details/5260947293?utm_medium=api&utm_source=6fec1d82",
      "description": "Skill: Service Now ITOM and Service Now ITAM Experience: 6 Years Location: THANE||HYDERABAD||PUNE Job description: 5 years of minimum experience (must have) on ServiceNow ITOM development Or ITAM improvement including Discovery, CMDB, Cloud Integration, Event Management & Asset Management, CSM Development. No admin experience is required. Responsibilities: Responsible for developing technical solutions on the ServiceNow satisfy the business needs of the IT department and beyond. Good practice i…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "ITC Infotech"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-21T08:52:38Z",
      "redirect_url": "https://www.adzuna.in/details/5260946155?utm_medium=api&utm_source=6fec1d82",
      "description": "We're Hiring: Windchill Developer/Customization Specialist  Location: Any ITC Location  Experience: 3–10 Years Are you a skilled Windchill developer looking to work on impactful PLM solutions? We’re expanding our team and looking for professionals with 3 to 10 years of experience in Windchill development and customization across any of our ITC locations .  Key Requirements: Strong PLM domain knowledge Hands-on experience in Windchill development & customization Solid understanding of Java, J2EE…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "HCLTech"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-15T08:47:20Z",
      "redirect_url": "https://www.adzuna.in/details/5251429684?utm_medium=api&utm_source=6fec1d82",
      "description": "Responsibilities: Assist in the development and validation of PDKs for various process nodes. Support the integration of technology files, DRC/LVS decks, and device models into EDA tools (e.g., Cadence, Synopsys). Write and maintain automation scripts (e.g., Python, TCL, Shell) to streamline PDK development processes. Collaborate with layout, design, and modeling teams to ensure PDK accuracy and usability. Troubleshoot and fix issues in PDK components related to DRC, LVS, parasitic extraction, …"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Birlasoft"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-15T08:47:45Z",
      "redirect_url": "https://www.adzuna.in/details/5251430531?utm_medium=api&utm_source=6fec1d82",
      "description": "EPM Developer Requirement Exp-5-10 Years Location- Hyderabad/Bangalore/Noida/Pune/Chennai JD- Over 5 years of experience in EPM consulting and implementation, specifically with EPM cloud products. Proficient in developing custom integrations using EPM Data Integration, EPM Integration Agent, Pipeline, Groovy Business Rules, and EPM Automate. Design and implement data integration processes to ensure seamless data flow between Oracle EPM and other enterprise systems. Development experience in end…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Alp Consulting Ltd."
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-18T08:47:15Z",
      "redirect_url": "https://www.adzuna.in/details/5255669693?utm_medium=api&utm_source=6fec1d82",
      "description": "Key Responsibilities CCM Solution Design Development Develop document templates and workflows using Quadient Inspire Scaler Interactive Automation and Interactive modules Hands on experience in WFD creation setting up Interactive Experience with data modules workflow creation writing rules scripts data transformations within the Inspire Designer is a must Should create and design forms in Inspire Designer based on the business specifications Participate in architecture discussions providing ins…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tag"
      },
      "location": {
        "display_name": "Tamil Nadu, India"
      },
      "created": "2025-06-21T08:52:52Z",
      "redirect_url": "https://www.adzuna.in/details/5260946843?utm_medium=api&utm_source=6fec1d82",
      "description": "Role Overview: The Developer will work as part of our Pharma/ life Sciences digital team to develop online and mobile based assets/promotional materials The primary responsibilities of the role are: Comes with an overall experience of 5 plus years in Digital domain and preferably from an agency with Pharma clients handled. Responsible for the framework and development of eDetailers/IVAs, eMailers, Landing pages and rich media banner ads. The dev should be able to work with other dev’s code and …"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "SHAFT SOFTWARE SOLUTIONS PRIVATE Ltd"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-08T10:16:55Z",
      "redirect_url": "https://www.adzuna.in/details/5239747933?utm_medium=api&utm_source=6fec1d82",
      "description": "Boomi Developer 4-12 Years Chennai/Bang/Hyd • 3 years' dev. exp. in Boomi, API - implementation & support projects. • Strong in Boomi, Process build & deployment, API management, alert framework/exception handling, • integration packs usage, performance tuning and operations. Expertise in dev of integration processes, • define requirements. Design, implement & document integration processes varying in levels of Develop test plan specs, test and debug processes. • Execute load testing. Works wit…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "HCLTech"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T09:46:01Z",
      "redirect_url": "https://www.adzuna.in/details/5235653242?utm_medium=api&utm_source=6fec1d82",
      "description": "Skill Matrix: Knowledge of HL7 standards: Understanding of HL7 message formats, data elements, and protocols. Programming skills: Proficiency in programming languages and Scripting (Object Script / Java Script) and technologies used to develop interfaces. Integration Tools : Inter Systems - Ensemble (2-4 years) hands on development experience SQL knowledge: Ability to work with databases and SQL queries. Experience with healthcare IT systems: Understanding of electronic medical records (EMR), p…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "HCLTech"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-18T08:47:21Z",
      "redirect_url": "https://www.adzuna.in/details/5255669970?utm_medium=api&utm_source=6fec1d82",
      "description": "Experience: 7 years Key Responsibilities • Lead the architecture, design, and development of enterprise-scale web applications with integrated Generative AI capabilities. • Define technical standards, architectural patterns, and best practices for scalable and secure software systems. • Collaborate with product, AI/ML, DevOps, and security teams to ensure alignment between business goals and technical execution. • Oversee full-stack development lifecycle, ensuring robust design, performance tun…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Infosys"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-05-31T08:39:38Z",
      "redirect_url": "https://www.adzuna.in/details/5224308710?utm_medium=api&utm_source=6fec1d82",
      "description": "Infosys– Manufacturing – XSLT Developer – Technology Analyst – XSLT, XSL-FO At Infosys, we pioneered and perfected the global delivery model, introducing to our customers the ability to move technology work to different locations where talent is readily available and quality is both impeccable and cost competitive. Over the years we have applied this model to a full range of services - both technical and business. Our IT services such as application integration, testing, maintenance and infrast…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "People Prime Worldwide"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-28T07:05:25Z",
      "redirect_url": "https://www.adzuna.in/details/5272416800?utm_medium=api&utm_source=6fec1d82",
      "description": "About Company : Our client is a global technology company headquartered in Santa Clara, California. it focuses on helping organisations harness the power of data to drive digital transformation, enhance operational efficiency, and achieve sustainability. over 100 years of experience in operational technology (OT) and more than 60 years in IT to unlock the power of data from your business, your people and your machines. We help enterprises store, enrich, activate and monetise their data to impro…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Ubique Systems"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-28T07:05:14Z",
      "redirect_url": "https://www.adzuna.in/details/5272416639?utm_medium=api&utm_source=6fec1d82",
      "description": "Ubique Systems is hiring. Location: Bangalore/Chennai Experience: 6 years Role: Senior Software Developer (PHP Symfony) Working Time Zone: EMEA timezone. JD: Primary Skills: Strong expertise in PHP with a focus on Symfony framework Experience with Laravel is a plus Secondary Skills (Good to Have): Familiarity with Java and Angular – understanding of core concepts and willingness to work with these technologies Additional Technologies: Database: MySQL, MongoDB (or similar) Cloud: Experience with…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-15T08:47:27Z",
      "redirect_url": "https://www.adzuna.in/details/5251429929?utm_medium=api&utm_source=6fec1d82",
      "description": "Greetings from TCS TCS is hiring for React Js TCS Walk In Drive on 21st June for React Js Location- TCS - Chennai[Sholinganallur] Experience - 3 Yrs Virtual drive date:- 21st June 2025 Venue Details: Tata Consultancy Services LTD,Kumaran Nagar, 415/21-24, TNHB Main Rd, Chennai, Tamil Nadu 600119 JD: React JS Functional components, ES6 (JavaScript), CSS, ReactJS built-in hooks, ReactJS class based components, ReactJS custom hooks development, Redux, Redux toolkit, React UI frameworks Interested …"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-08T10:18:15Z",
      "redirect_url": "https://www.adzuna.in/details/5239748774?utm_medium=api&utm_source=6fec1d82",
      "description": "Position-Kafka Developer Location- Bengaluru Experience-5-9 years Notice Period- 0-30 Days Must have Experience in Java, Kafka, Python Developer: A strong understanding of Kafka architecture, including brokers, topics, partitions, and consumer groups, alongside skills in reading and interpreting logs, monitoring metrics, familiarity with distributed systems concepts, proficiency in programming languages like Java or Scala, and knowledge of network connectivity and configuration to identify and …"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "VARITE INC"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-28T07:05:36Z",
      "redirect_url": "https://www.adzuna.in/details/5272416927?utm_medium=api&utm_source=6fec1d82",
      "description": "5 – 8 years of hands-on working experience on at least 2-3 full lifecycle projects on end-to-end Coupa implementation/support •2– 3 years of hands-on working experience on at least 1 full lifecycle projects on end-to-end Coupa Risk Assess (CRA) implementation/support •Technical Expertise: Serve as the subject matter expert on Coupa's technical architecture, providing guidance on system configuration, integration, and customization •Solution Design: Collaborate with business stakeholders to unde…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-08T10:13:48Z",
      "redirect_url": "https://www.adzuna.in/details/5239731134?utm_medium=api&utm_source=6fec1d82",
      "description": "Dear Candidate, Greetings from TATA Consultancy Services! Thanks for your interest in exploring opportunities with TCS TCS Virtual Drive on 11th June for Angular developer Interview Details: Location - Kolkata, Chennai, Pune, Hyderabad, Mumbai, Indore Scheduled Date: 11-June- 25 Scheduled Time: 10 AM-1:00 PM 10 AM-1:00 PM 2:00 PM-6:15 PM Once we receive the below details will share the interview invite. Please share your details in below format on sampurna.mali@tcs.com Full name : Email id: Con…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-15T08:47:32Z",
      "redirect_url": "https://www.adzuna.in/details/5251430076?utm_medium=api&utm_source=6fec1d82",
      "description": "We are conducting Walkin drive on 14th Jun 2025 at our Bangalore office Required Technical Skill Set: AIML, LLM, NLP, Python/ AWS DevOps  Terraforms Experience: 4 to 10 years Location: Bangalore  Event Date: 14th Jun 2025  Registration Timing: 09:00 AM – 1:00 PM  Experience Required: 4 to 12 Years Main Skill Exp Range Location* AIML 4-10 Years Bangalore AWS DevOps  Terraforms 5-12 Years Bangalore Must-Have: Expertise on NLP, LAMA Model Expertise AI, ML, GENAI Experience on identifying right mod…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-24T09:48:41Z",
      "redirect_url": "https://www.adzuna.in/details/5264990181?utm_medium=api&utm_source=6fec1d82",
      "description": "Greetings from TCS! TCS is conducting Virtual interview drive. Date of virtual interview: 26th June Joining location: Bangalore Skill: CyberArk Exp Range: 5-8 yrs JOB DESCRIPTION: Key Responsibilities: · Design, implement, and manage Secret Management solutions using CyberArk Credential Provider, Central Credential Provider and CyberArk Conjur. · Develop and enforce policies and procedures for secure handling of secrets and credentials. · Monitor and audit secret management systems to ensure co…"
    },
    {
      "title": "Developer",
      "company": {
        "display_name": "Tata Consultancy Services"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-05-31T08:39:05Z",
      "redirect_url": "https://www.adzuna.in/details/5224308520?utm_medium=api&utm_source=6fec1d82",
      "description": "Greetings from TCS TCS is hiring for SMALLTALK Developers for PAN INDIA locations . ( We are okay with International candidates as well if suitable candidates we get) Job Location : PAN INDIA / OUTSIDE INDIA AS WELL Mode of Interview : Virtual/ telephonic. Desired Experiance range : 5 years to 10 years DESIRED COMPETENCIES MUST HAVE Smalltalk Programming, Strong OOPS concepts, SDLC knowledge, Good Communication skills (for client interaction independently Good-to-Have PL/SQL, Java, GitHub, UNIX…"
    }
  ]
}